# Operações com Matrizes
* ### A biblioteca pandas possui vários métodos para aplicação em matrizes:
    * **add:** soma os elementos das posições correspondentes das matrizes.
    * **sub:** subtrai os elementos das posições correspondentes das matrizes.
    * **div:** realiza a divisão real entre os elementos das posições correspondentes das matrizes.
    * **mul:** multiplica os elementos das posições correspondentes das matrizes.
    * **eq:** verifica se os elementos das posições correspondentes das matrizes são iguais.
    * **ne:** verifica se os elementos das posições correspondentes das matrizes são diferentes.
    * **dot:** realiza a multiplicação das matrizes.

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([[19, 23, 34],
                    [80, 75, 60],
                    [25, 32, 15]])

print("**************************************** DataFrame 1 ****************************************\n", df1)

# df2

df2 = pd.DataFrame([[21, 27, 35],
                    [85, 70, 60],
                    [25, 50, 15]])

print("\n**************************************** DataFrame 2 ****************************************\n", df2)

**************************************** DataFrame 1 ****************************************
     0   1   2
0  19  23  34
1  80  75  60
2  25  32  15

**************************************** DataFrame 2 ****************************************
     0   1   2
0  21  27  35
1  85  70  60
2  25  50  15

## **add()**

In [3]:
df1.add(df2)

     0    1    2
0   40   50   69
1  165  145  120
2   50   82   30

## **sub()**

In [4]:
df1.sub(df2)

   0   1  2
0 -2  -4 -1
1 -5   5  0
2  0 -18  0

## **div()**

In [5]:
df1.div(df2)

          0         1         2
0  0.904762  0.851852  0.971429
1  0.941176  1.071429  1.000000
2  1.000000  0.640000  1.000000

## **mul()**

In [6]:
df1.mul(df2)

      0     1     2
0   399   621  1190
1  6800  5250  3600
2   625  1600   225

## **eq()**

In [13]:
df1.eq(df2)

       0      1      2
0  False  False  False
1  False  False   True
2   True  False   True

## **ne()**

In [16]:
df1.ne(df2)

       0     1      2
0   True  True   True
1   True  True  False
2  False  True  False

## **Obs:** Também podes usar a lib numpy para fazer operações...

In [14]:
import numpy as np
np.add(df1, df2)

     0    1    2
0   40   50   69
1  165  145  120
2   50   82   30

In [15]:
np.equal(df1,df2)

       0      1      2
0  False  False  False
1  False  False   True
2   True  False   True

In [26]:
np.dot(df1,df2)

array([[ 3204,  3823,  2555],
       [ 9555, 10410,  8200],
       [ 3620,  3665,  3020]])